jumpseller_be_app/app/models/sun_time.rb

SELECT "sun_times".* FROM "sun_times" WHERE "sun_times"."location" = '123123123' AND "sun_times"."date" = '2025-02-14' LIMIT 1
INSERT INTO "sun_times" ("location", "sunrise_time", "sunset_time", "golden_hour", "date", "created_at", "updated_at", "timezone") VALUES ('Souselas', NULL, '2000-01-01 17:11:10', '2000-01-01 16:27:50', '2024-12-20', '2025-02-15 11:56:49.017979', '2025-02-15 11:56:49.017979', 'Europe/Lisbon') RETURNING "id"
SELECT 1 AS one FROM "sun_times" WHERE "sun_times"."date" = '2025-02-16' AND "sun_times"."location" = 'Souselas' LIMIT 1
---
    def self.find_or_fetch(location, date_start, date_end)
        final_data = []

        (Date.parse(date_start)..Date.parse(date_end)).each do |date|

            sun_time = find_by(location: location, date: date)

            if sun_time
                final_data << organize_data(sun_time)
            else
                coord = translate_location_to_coords(location)
                if coord.present?
                    response = get_sun_data_from_api(coord, date, date)
                    if response[:success]
                        newEntry = response[:data]
                        sun_time = SunTime.create(
                            location: location,
                            sunrise_time: newEntry[:sunrise].present? ? Time.parse(newEntry[:sunrise]).strftime("%H:%M:%S") : nil,
                            sunset_time: newEntry[:sunset].present? ? Time.parse(newEntry[:sunset]).strftime("%H:%M:%S") : nil,
                            golden_hour: newEntry[:golden_hour].present? ? Time.parse(newEntry[:golden_hour]).strftime("%H:%M:%S") : nil,
                            timezone: newEntry[:timezone],
                            date: date,
                        )